module.exports = {
    /**
     * 售后类型
     * 0仅退款，1退货退款，2换货
     */
    REFUND_TYPE: {
        0: '仅退款',
        1: '退货退款',
        2: '换货'
    },
    /**
     * 售后状态
     * 0仅退款，1退货退款，2换货
     */
    REFUND_STATUS: {
        0: '待审核', //新建
        1: '待打款', //待退款
        2: '已拒绝', //拒绝完结
        3: '撤销', //撤销
        4: '待买家发货', //请退货
        5: '商家待收货', //退货中
        6: '商家待发货', //待重新发货
        7: '已完结', //打款/重发完结
        8: '已拒绝', //拒绝打款
        9: '已完成' // 商家已重新发货
    },
    /**
     * 售后操作步骤
     *  '步骤：1审核；2我们确认收货 3财务打款 4我们再次发货 5原路返回退款',
     */
    REFUND_STEP: {
        1: '审核',
        2: '商家确认收货',
        3: '财务打款',
        4: '商家再次发货',
        5: '原路返回退款'
    }
};
